Merge pull request #3738 from shakenfist/sync-docs
Automated documentation sync for 20260813.
